_posts/2014-11-18-Cpp-Memo-5.html
---
layout : post
title : CPP Info Memo Part 5 -- Diagnostics
description : introduction of warning and error directives.
categories : C/C++
tags :  preprocessor diagnostics
---
<p>
<code>#error</code> and <code>#warning</code> are used for diagnostics.
</p>

<ul class="org-ul">
<li><code>#error</code> will cause proprocessor to report a fatal error and stop pre-processing.

<p>
 <code>#error</code> normally should be placed inside a conditional that detects a combination
of parameters which should not be supported, for example:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #32cd32;">#ifdef</span> __vax__
<span style="color: #32cd32;">#error</span> <span style="color: #d78700;">"Won't work on VAXen.  See comments at get_last_object."</span>
<span style="color: #32cd32;">#endif</span>
</pre>
</div>

<p>
Or:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #32cd32;">#if</span> !<span style="color: #32cd32;">defined</span>(UNALIGNED_INT_ASM_OP) &amp;&amp; <span style="color: #32cd32;">defined</span>(DWARF2_DEBUGGING_INFO)
<span style="color: #32cd32;">#error</span> <span style="color: #d78700;">"DWARF2_DEBUGGING_INFO requires UNALIGNED_INT_ASM_OP."</span>
<span style="color: #32cd32;">#endif</span>
</pre>
</div>
</li>

<li><code>#warning</code> is like <code>#error</code>, but cuases the preprocessor to issue a wanrning and then continue preprocessing.
It is usually used in obsolete header files:

<div class="org-src-container">

<pre class="src src-c"><span style="color: #32cd32;">#if</span><span style="color: #32cd32;">n</span><span style="color: #32cd32;">def</span> _OBSOLETE_H_
<span style="color: #32cd32;">#define</span> <span style="color: #daa520;">_OBSOLETE_H_</span>

<span style="color: #32cd32;">#warning</span> <span style="color: #d78700;">"This file is obsoleted..."</span>

<span style="color: #32cd32;">#endif</span> <span style="color: #fa8072;">/* </span><span style="color: #cd5c5c; font-style: italic;">_OBSOLETE_H_ </span><span style="color: #fa8072;">*/</span>
</pre>
</div>
</li>
</ul>


<p>
     Neither <code>#error</code> nor <code>#warning</code> macro-expands its argument.
Internal whitespace sequences are each replaced with a single space.
The line must consist of complete tokens.  It is wisest to make the
argument of these directives be a single string constant; this avoids
problems with apostrophes and the like.
</p>
